# ViewerBoundOffsetTop Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewerBoundOffsetTop Property
ParameterTypeId Class See Also
---
"Top Clip Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewerBoundOffsetTop { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewerBoundOffsetTop As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewerBoundOffsetTop {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace